<template>
    <div id="heli">
        <h3 id="title" v-text="obj.title" ></h3>
        <div id="disclaimers">本故事纯属虚构，如有雷同纯属巧合。</div>
        <div v-html="obj.content" class="richText" ></div>
    </div>
</template>


<script>
/**
 * 何立传  合计80W字
 * 10万与美女
 * 40万金边火拼
 * 70万遭遇背叛
 */
export default {
    data(){
        return {
            obj:{},
            heliArr:[
                {id:1,title:'标题01',content:`<p>我叫何立,是个程序员，目前在北京搞前端开发。</p>
                <p>最近公司加班越来越严重了，听同事说，A座昨天又跪一个经理，貌似是赶着项目上线，连肝了2个晚上，早上同事发现的时候身体已经凉了，狗日的领导，出这么大的事，硬捂着消息不放，还让我们加班到12点，还是不是人了。</p>
                <p>唉，也就能脑子里想想，现实还不是得加班干活，天天看着挺忙，毛线钱没赚到，马上又要10号了，还得还花呗，这点工资完全不够用啊。</p>
                <p>北京上班看着工资挺高的，一个月一万多，这都是表面，经不起算。房租水电吃喝拉撒一万多的工资到月底能剩下三千就已经很不错了，何况我这还是单身。</p>
                <p>就这还不说隔三岔五，朋友结婚，生孩子啥的，每年10月，工资根本不够送礼，真是吐了。</p>
                <p>得看看有没有办法多搞点钱。</p>
                <p>要不去看看兼职？好像不太行，下班有那个时间在家躺着多舒服啊。要不试试理财？可别闹了，就我这点钱别说理财了，六位数的密码保护四位数的存款，根本就不够格，我感觉我现在当务之急是得多赚点，有啥办法能年入几十万，哪怕累点呢，干个几年回家养老...</p>
                <p>华为本部，一年70W。可是咱进不去啊，就我这学历水平，差点意思，低难度的我想想。</p>
                <p>阿里外包？一年40W。这个估计悬，技术貌似达不到人家要求，得再低一点。</p>
                <p>其他的法子是真想不到了啊，违法犯罪的事咱不能干，偷鸡摸狗的事又不敢，真后悔当时没好好读书，淦。</p>
                <p>“高，有啥法子能多赚点钱不，好™缺钱啊？”小高是我大学同学，毕业两年后来跟我一起在这家公司上班。</p>
                <p>“干活呗，还有其他啥法子，别老想着豪车洋房，凑合着能过得了，不是每个人的爹都叫王健林，咱就是普通人。”小高眼睛盯着屏幕，像是在改bug。</p>
                <p>“我想去国外看看，真的，看网上帖子，国外不加班，而且待遇还不错，想去试试，就算工资不高就当是去旅游了。”昨晚玩手机的时候看到国外的招聘广告，待遇那叫一个好啊。</p>
                <p>“立仔，别了吧，国内都混不下去还往国外跑，外面不一定比国内好，我总觉得外面不安全。”小高扭过来，小声跟我说，“我听别人说，虽然国外确实福利好，酒店洋房美女，但是吧，没见几个回来的。”</p>
                <p>小高顿了顿，又说道“不是我不想去外面看，得找个老司机带着咱，就指望咱俩生瓜蛋子出去摸索，估计刚出去就被骗了，兜里那点钱还不够人家塞牙缝。”</p>
                <p>卧槽，外面有这么乱么？小高不会是逗我的吧。</p>
                <p>“再说吧，先干活吧，今晚项目上线，出国的事再说吧，先把活干了“，花呗不再不还要出事了。</p>
                <p></p>
                <p>XX招聘联系 提供西港就业岗位信息</p>
                <p></p>
                <p>小高突然说要去西港</p>
                <p></p>
                <p>出发去西港</p>
                <p></p>
                <p></p>
                <p></p>
                `},
                {id:2,title:'标题02',content:`<p>西港被骗</p>
                <p></p>
                <p>重新找活</p>
                <p></p>
                <p>加入某不正常公司写正常代码</p>
                <p></p>
                <p></p>
                `},
                {id:3,title:'标题03',content:`<p>日子开始好起来</p>
                <p></p>
                <p>jc来了</p>
                <p></p>
                <p>继续跑路生涯</p>
                <p></p>
                <p></p>
                `},
                {id:4,title:'标题04',content:`<p>自己成立公司</p>
                <p></p>
                <p>搞不正常公司</p>
                <p></p>
                <p>傻逼真多</p>
                <p></p>
                `},
            ]
        }
    },
    watch:{
        '$route.query.page':function(newVal){
            this.heliArr.forEach((item)=>{
                if(item.id == newVal ){
                    this.obj = item
                }
            })
        }
    }
}
</script>

<style scoped>
.richText{
    line-height: 30px;
    font-size: 16px;
}
.richText >>> p{
    text-indent: 32px;
}
#title{
    font-size: 24px;
    text-align: center;
    font-weight: bold;
}
#disclaimers{
    margin: 20px 0;
    text-align: center;
    font-size: 20px;
}
</style>
